
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	События.Дата,
	                      |	События.Момент
	                      |ИЗ
	                      |	РегистрСведений.ктв_сб_События КАК События
	                      |ГДЕ
	                      |	События.ТочкаВозникновения = &ТочкаВозникновения
	                      |	И События.Ид = &Ид");
					  
	Запрос.УстановитьПараметр("ТочкаВозникновения"	, Запись.ТочкаВозникновения);
	Запрос.УстановитьПараметр("Ид"					, Запись.Ид);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаСобытия = Выборка.Дата;
		МоментСобытия = Выборка.Момент;
	КонецЕсли;
	
КонецПроцедуры //ПриСозданииНаСервере()
