#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбновитьПоСпискуПользователейИБ(ТолькоПроверка = Ложь, Удалять = Ложь, ЕстьИзмененные = Ложь) Экспорт
	
	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	
	Для Каждого ТекПользовательИБ Из ПользователиИБ Цикл
		
		ТекПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",
							ТекПользовательИБ.УникальныйИдентификатор);
							
		Если ЗначениеЗаполнено(ТекПользователь) Тогда
			ТекПользователь = ТекПользователь.ПолучитьОбъект();
		Иначе
			ТекПользователь = Справочники.Пользователи.СоздатьЭлемент();
			ТекПользователь.ИдентификаторПользователяИБ = ТекПользовательИБ.УникальныйИдентификатор;
		КонецЕсли;
		
		ТекПользователь.Наименование = ТекПользовательИБ.ПолноеИмя;
		
		ТекПользователь.Записать();
		
	КонецЦикла;
	
КонецПроцедуры // ОбновитьПоСпискуПользователейИБ()

Функция ТекущийПользователь() Экспорт
	
	ТекущийПользователь = Справочники.Пользователи.ПустаяСсылка();
	
	ТекущийПользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",
							ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
							
	Возврат ТекущийПользователь;
	
КонецФункции // ТекущийПользователь()

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Отбор.Свойство("Недействителен") Тогда
		Параметры.Отбор.Вставить("Недействителен", Ложь);
	КонецЕсли;
	
	Если НЕ Параметры.Отбор.Свойство("Служебный") Тогда
		Параметры.Отбор.Вставить("Служебный", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
