
&НаСервереБезКонтекста
Процедура ЗаполнитьПоПользователямИБНаСервере()
	
	Справочники.Пользователи.ОбновитьПоСпискуПользователейИБ();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПользователямИБ(Команда)
	
	ЗаполнитьПоПользователямИБНаСервере();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры // ЗаполнитьПоПользователямИБ()

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	МассивИД = Новый Массив();
	
	Для Каждого ТекПользовательИБ Из ПользователиИБ Цикл
		МассивИД.Добавить(ТекПользовательИБ.УникальныйИдентификатор);
	КонецЦикла;
	
	Если ИмяЭлемента = "Список" Тогда
		Для Каждого ТекСтрока Из Строки Цикл
			Если НЕ МассивИД.Найти(ТекСтрока.Ключ.ИдентификаторПользователяИБ) = Неопределено Тогда
				ТекСтрока.Значение.Данные.ЕстьПользовательИБ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
