
&НаКлиенте
Процедура СодержимоеСоответствияЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СодержимоеСоответствия.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Значение) = Тип("Структура")
	 ИЛИ ТипЗнч(ТекущиеДанные.Значение) = Тип("ФиксированнаяСтруктура")
	 ИЛИ ТипЗнч(ТекущиеДанные.Значение) = Тип("Соответствие")
	 ИЛИ ТипЗнч(ТекущиеДанные.Значение) = Тип("ФиксированноеСоответствие") Тогда
		СтандартнаяОбработка = Ложь;
		ФормаПросмотра = ПолучитьФорму("РегистрСведений.ктв_сб_События.Форма.ФормаПросмотраСоответствия", Новый Структура("Соответствие", ТекущиеДанные.Значение), ЭтаФорма.УникальныйИдентификатор, Истина);
		ФормаПросмотра.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Соответствие") Тогда
		
		Для Каждого ТекЭлемент Из Параметры.Соответствие Цикл
			НоваяСтрока = СодержимоеСоответствия.Добавить();
			НоваяСтрока.Имя			= ТекЭлемент.Ключ;
			НоваяСтрока.Значение	= ТекЭлемент.Значение;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
