
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТипСервисаПриИзменении(Элементы.ТипСервиса);
	
КонецПроцедуры //ПриОткрытии()

&НаКлиенте
Процедура ТипСервисаПриИзменении(Элемент)
	
	Если Объект.ТипСервиса = ПредопределенноеЗначение("Перечисление.ктв_сб_ТипСервиса.СОАП") Тогда
		Элементы.Сервер.Видимость				= Ложь;
		Элементы.ПространствоИмен.Видимость		= Истина;
		Элементы.ИмяСервиса.Видимость			= Истина;
		Элементы.ИмяТочкиПодключения.Видимость	= Истина;
	Иначе
		Элементы.Сервер.Видимость				= Истина;
		Элементы.ПространствоИмен.Видимость		= Ложь;
		Элементы.ИмяСервиса.Видимость			= Ложь;
		Элементы.ИмяТочкиПодключения.Видимость	= Ложь;
	КонецЕсли;
	
КонецПроцедуры //ТипСервисаПриИзменении()

