
// Функция - Обработчик метода GetEventsRegistered Web-сервиса EventHub
//			возвращает список зарегистрированных событий
//
// Возвращаемое значение:
//  Массив (Структура) - Список зарегистрированных событий
//
Функция GetEventsRegistered()
	
	МассивСобытий = ктв_сб_СобытияОбработкаВнешнихЗапросов.ПолучитьСписокЗарегистрированныхСобытий();
	
	Возврат СериализаторXDTO.ЗаписатьXDTO(МассивСобытий);
	
КонецФункции //GetEventsRegistered()

// Функция - Обработчик метода EventRise Web-сервиса EventHub
//			регистрирует переданные события и запускает обработку событий
//
// Параметры:
//  EventArray	 - Массив (Структура)	 - Массив событий для регистрации
//  Error		 - Строка				 - Описание возникших ошибок
// 
// Возвращаемое значение:
//  Булево - Истина - События успешно зарегистрированы; Ложь - при регистрации событий возникли ошибки
//
Функция EventRise(EventArray, Error = "")
	
	МассивСобытий = СериализаторXDTO.ПрочитатьXDTO(EventArray);
	
	Если НЕ ТипЗнч(МассивСобытий) = Тип("Массив") Тогда
		Error = "Описание событий должно иметь тип ""Массив""!";
		Возврат Ложь;
	КонецЕсли;
	
	ОписаниеОшибок = "";
	
	РезультатРегистрации = ктв_сб_СобытияОбработкаВнешнихЗапросов.ЗарегистрироватьСобытия(МассивСобытий, Error);
	
	Возврат РезультатРегистрации;
	
КонецФункции //EventRise()

// Функция - Обработчик метода GetEventPoints Web-сервиса EventHub
//			возвращает список зарегистрированных точек возникновения событий
//
// Возвращаемое значение:
//  Массив (Структура) - Список зарегистрированных точек возникновения событий
//
Функция GetEventPoints()
	
	МассивТочек = ктв_сб_СобытияОбработкаВнешнихЗапросов.ПолучитьСписокТочекВозникновенияСобытий();
	
	Возврат СериализаторXDTO.ЗаписатьXDTO(МассивТочек);
	
КонецФункции //GetEventPoints()

// Функция - Обработчик метода GetThisEventPoint Web-сервиса EventHub
//			возвращает описание точки возникновения событий, соответствующее текущей ИБ
//
// Возвращаемое значение:
//  Массив (Структура) - Массив, содержащий 1 элемент с описанием точки возникновения событий,
//						 соответствующей текущей ИБ
//
Функция GetThisEventPoint()
	
	МассивТочек = ктв_сб_СобытияОбработкаВнешнихЗапросов.ПолучитьСписокТочекВозникновенияСобытий(Истина);
	
	Возврат СериализаторXDTO.ЗаписатьXDTO(МассивТочек);
	
КонецФункции //GetThisEventPoint()
