// Функция - Возвращает настройки доступа к http/web-сервису
//
// Параметры:
//  Сервис_Адрес							- СправочникСсылка.		- Описание параметров доступа к http/web-сервису
//											  ктв_сб_АдресаСервисов
//	УстановленноеСоединение                 - WebПрокси		  		- Полученный ранее объект соединения с web-сервисом для повторного использования
//	УстановленноеСоединение_Использование	- Булево				- Флаг необходимости повторного использования объекта соединения с web-сервисом 
// 
// Возвращаемое значение:
// 	Структура					- Структура настроек подключения к сервису, в т.ч.:
//		Сервис_ТипСервиса						- ПеречислениеСсылка.	- Тип сервиса SOAP/HTTP
//												  ктв_сб_ТипСервиса
//		Сервис_Сервер							- Строка			- Адрес сервера http-сервиса
//		Сервис_АдресРесурса						- Строка			- Адрес ресурса http/web-сервиса
//		Сервис_ПространствоИмен					- Строка			- Пространство имен web-сервиса
//		Сервис_ИмяСервиса						- Строка			- Имя web-сервиса
//		Сервис_ИмяТочкиПодключения				- Строка			- Имя точки подключения web-сервиса
//		Сервис_Пользователь						- Строка			- Имя пользователя сервиса
//		Сервис_Пароль							- Строка			- Пароль пользователя сервиса
//		УстановленноеСоединение                 - WebПрокси		    - Полученный ранее объект соединения с web-сервисом для повторного использования
//		УстановленноеСоединение_Использование	- Булево			- Флаг необходимости повторного использования объекта соединения с web-сервисом 
//
Функция ПолучитьНастройкиСоединения(Сервис_Адрес, УстановленноеСоединение_Использование = Ложь, УстановленноеСоединение = Неопределено) Экспорт
	
	Возврат ктв_ОбщегоНазначенияРаботаССервисами.ПолучитьНастройкиСоединения(Сервис_Адрес, УстановленноеСоединение_Использование, УстановленноеСоединение);
	
КонецФункции //ПолучитьНастройкиСоединения()

// Функция - Возвращает настройки доступа к http/web-сервису для указанной точки подключения
//
// Параметры:
//  ТочкаПодключения						- СправочникСсылка.		- Ссылка на точку возникновения событий внешней ИБ
//											  ктв_сб_СобытияТочкиВозникновения
//	УстановленноеСоединение                 - WebПрокси		  		- Полученный ранее объект соединения с web-сервисом для повторного использования
//	УстановленноеСоединение_Использование	- Булево				- Флаг необходимости повторного использования объекта соединения с web-сервисом 
// 
// Возвращаемое значение:
// 	Структура					- Структура настроек подключения к сервису, в т.ч.:
//		Сервис_ТипСервиса						- ПеречислениеСсылка.	- Тип сервиса SOAP/HTTP
//												  ктв_сб_ТипСервиса
//		Сервис_Сервер							- Строка			- Адрес сервера http-сервиса
//		Сервис_АдресРесурса						- Строка			- Адрес ресурса http/web-сервиса
//		Сервис_ПространствоИмен					- Строка			- Пространство имен web-сервиса
//		Сервис_ИмяСервиса						- Строка			- Имя web-сервиса
//		Сервис_ИмяТочкиПодключения				- Строка			- Имя точки подключения web-сервиса
//		Сервис_Пользователь						- Строка			- Имя пользователя сервиса
//		Сервис_Пароль							- Строка			- Пароль пользователя сервиса
//		УстановленноеСоединение                 - WebПрокси		    - Полученный ранее объект соединения с web-сервисом для повторного использования
//		УстановленноеСоединение_Использование	- Булево			- Флаг необходимости повторного использования объекта соединения с web-сервисом 
//
Функция ПолучитьНастройкиСоединенияДляТочки(ТочкаПодключения, УстановленноеСоединение_Использование = Ложь, УстановленноеСоединение = Неопределено) Экспорт
	
	Возврат ктв_ОбщегоНазначенияРаботаССервисами.ПолучитьНастройкиСоединения(ТочкаПодключения.СервисСобытий_Адрес, УстановленноеСоединение_Использование, УстановленноеСоединение);
	
КонецФункции //ПолучитьНастройкиСоединенияДляТочки()

